VuDaiDuong-23520359/MPU-MCU_project/STM32/Core/Src/main.c
        case 2:
            // Transition blue → red
            factor1 = 1.0f - ((float)((ind % 60) - 40) / 20.0f);
            factor2 = ((float)((ind % 60) - 40) / 20.0f);
            rr = (uint8_t)(255.0f * factor2);
            gg = 0;
            bb = (uint8_t)(255.0f * factor1);
            break;
    }

    // Store results
    *red = rr;
    *green = gg;
    *blue = bb;
}

void effect_sound_color() {
    float ratio = (float)amp / amp_maxn;
    if (ratio > 1.0) ratio = 1.0;
    if (ratio <= 0.05f) {
    	Turn_off_all_at_once();
    	WS2812_Send();
    	return;
    }

    int brightness = 5 + (int)(ratio * (NORMAL_BRIGHTNESS - 5));
    Set_Brightness(brightness);

    uint8_t r, g, b;

    if (ratio < 0.5f) {
        float t = ratio / 0.5f;
        r = (uint8_t)(0 + t * (148 - 0));
        g = 0;
        b = (uint8_t)(255 + t * (211 - 255));
    } else {
        float t = (ratio - 0.5f) / 0.5f;
        if (t < 0.5f) {
            float t2 = t / 0.5f;
            r = 255;
            g = (uint8_t)(0 + t2 * (127 - 0));
            b = 0;
        } else {
            float t2 = (t - 0.5f) / 0.5f;
            r = 255;
            g = (uint8_t)(127 + t2 * (255 - 127));
            b = 0;
        }
    }

    for (int i = 0; i < MAX_LED; i++) {
        Set_LED(i, r, g, b);
    }
    WS2812_Send();
}

void ripple_effect(uint16_t amplitude) {
    float ratio = (float)amplitude / amp_maxn;
    if (ratio > 1.0f) ratio = 1.0f;

    if (ratio <= 0.05f) {
        Turn_off_all_at_once();
        WS2812_Send();
        return;
    }

    int center = MAX_LED / 2;
    int spread = 1 + (int)(ratio * (MAX_LED / 2));

    for (int i = 0; i < MAX_LED; i++) {
        int dist = abs(i - center);
        float brightness = 1.0f - ((float)dist / spread);
        if (brightness < 0.0f) brightness = 0.0f;

        // Get rainbow color based on position
        uint8_t r, g, b;
        get_rainbow_color(i, effStep, &r, &g, &b);

        // Apply brightness modulation to color
        Set_LED(i, (uint8_t)(r * brightness), (uint8_t)(g * brightness), (uint8_t)(b * brightness));
    }

    Set_Brightness(NORMAL_BRIGHTNESS);
    WS2812_Send();

    effStep = (effStep + 1) % 60;
}


void sound_bar_hue_gradient(uint16_t amplitude) {
    static int current_led_count = 1;
    int target_led_count;

    float ratio = (float)amplitude / amp_maxn;
    if (ratio > 1.0f) ratio = 1.0f;

    target_led_count = (int)(ratio * MAX_LED);
    if (target_led_count < 1) target_led_count = 1;

    if (amplitude < 100 && current_led_count > 1) {
        current_led_count--;
    } else if (target_led_count > current_led_count) {
        current_led_count++;
    }

    Turn_off_all_at_once();

    for (int i = 0; i < current_led_count; i++) {
        float t = (float)i / (current_led_count - 1);
        float hue = 270.0f * (1.0f - t); // tím (270°) → đỏ (0°)

        uint8_t r, g, b;
        HSV_to_RGB(hue, 1.0f, 1.0f, &r, &g, &b);
        Set_LED(i, r, g, b);
    }

    Set_Brightness(NORMAL_BRIGHTNESS);
    WS2812_Send();
}

void effect_random_one_in_six_leds_by_sound(uint16_t amplitude) {
    float ratio = (float)amplitude / amp_maxn;
    if (ratio > 1.0f) ratio = 1.0f;

    // Ignore low amplitude (silence)
    if (ratio <= 0.05f) {
        Turn_off_all_at_once();
        WS2812_Send();
        return;
    }

    Turn_off_all_at_once();

    const int group_size = 6; //per n Led will have 1 random led lighted
    for (int start = 0; start < MAX_LED; start += group_size) {
        int rand_index = rand() % group_size;
        int led_index = start + rand_index;
        if (led_index >= MAX_LED) break;

        // Optional: brighter when louder
        uint8_t brightness = (uint8_t)(ratio * 255);
        uint8_t r = brightness;
        uint8_t g = rand() % brightness;
        uint8_t b = rand() % brightness;

        Set_LED(led_index, r, g, b);
    }

    Set_Brightness(5 + (int)(ratio * (NORMAL_BRIGHTNESS - 5)));
    WS2812_Send();
}

/*	// for FFT
void Process_HalfBuffer(){
	static float leftIn, rightIn;
	static float leftProcessed, rightProcessed;
	static int16_t leftOut, rightOut;

	static int16_t fftIndex = 0;

	// Lock control settings
	controlSettingsLocked = 1;

	// Loop through half of double buffer
	for (uint8_t n = 0; n < (AUDIO_BUFFER_SIZE / 2) - 1; n += 2){

		// Convert to float
		leftIn = INT16_TO_FLOAT * ((float) inBufPtr[n]);
		rightin = INT16_TO_FLOAT * ((float) inBufPtr[n + 1]);

		// Fill FFT Buffer
		fftBufIn[fftIndex] = leftIn;
		fftIndex++;

		if (fftIndex == FFT_BUFFER_SIZE){
			// Perform FFT
			arm_rfft_fast_f32(&fftHandler, &fftBufIn, &fftBufOut, 0);

			// Set FFT Flag
			fftFlag = 1;

			// Reset FFT array index
			fftIndex = 0;
		}

		// Apply processing to input
		leftProcessed = leftIn;
		rightProcessed = rightIn;

		// Convert processed float to int16_t for output buffer
		leftOut = (int16_t) (FLOAT_TO_INT16 * outputVolume * leftProcessed);
		rightOut = (int16_t) (FLOAT_TO_INT16 * outputVolume * rightProcessed);

		// Set output buffer samples
		outBufPtr[n] = leftOut;
		outBufPtr[n] = rightOut;
	}
} */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_TIM1_Init();
  MX_ADC1_Init();
  /* USER CODE BEGIN 2 */
  /*// for FFT
  //Intialise FFT
  arm_rfft_fast_init_f32(&fftHandler, FFT_BUFFER_SIZE);

  float	peakVal	= 0.0f;
  uint16_t peakHz = 0;
  */

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// DUNG CO DUNG VAO
  calculate_middle_point();



  /* USER CODE END 2 */

